
## Plan Result (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8670638340)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_storage_bucket.public_image_bucket
  * google_storage_bucket_access_control.public_image_bucket


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_storage_bucket.public_image_bucket will be created
  + resource "google_storage_bucket" "public_image_bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "lgtm-public-image-bucket"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 3600
          + method          = [
              + "GET",
            ]
          + origin          = [
              + null,
            ]
          + response_header = [
              + "*",
            ]
        }
    }

  # google_storage_bucket_access_control.public_image_bucket will be created
  + resource "google_storage_bucket_access_control" "public_image_bucket" {
      + bucket = "lgtm-public-image-bucket"
      + domain = (known after apply)
      + email  = (known after apply)
      + entity = "allUsers"
      + id     = (known after apply)
      + role   = "READER"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"run-terraform-plan","PRNumber":3,"Program":"tfcmt","SHA1":"5571117b79047b1d97979f2e5e77c2ac37a588a4","Target":"dev","Vars":{},"WorkflowName":"Run terragrunt plan on PR submission"} -->